[
    {
        "id": "1gqhrt6",
        "title": "Looking for a US T86 entry broker for ecommerce goods entering by truck from Canada",
        "content": "Hi r/Logistics\n\nI consult for an organization that is looking for a US customs broker that can handle T86 entries for ecommerce for goods that cross the northern border by truck. Entry volume per day is around 5,000, increasing at peak. They ship six days a week, year round. Only a portion of these daily entries are on the table for this opportunity, but it is a permanent opportunity, and the percentage of entries to be filed as T86 will probably increase as regulatory ramps up in the US.\n\nThey're an experienced ecommerce 3PL with a stable client and commodity base. The client themselves holds all required FDA, Health Canada and other licenses or registrations. *This is not a marketplace like TEMU etc.* The clients have a mix of non-regulated and regulated products. Food, Dietary Supplements, general consumer household goods etc. COO is mixed but mostly COO US, Canada or China. These are currently cleared with a mix of S321, T86, informal and formal entries depending on the situation. They're looking for aggressive pricing from a broker well experienced in ecommerce that can handle mass submissions of entries (Excel template upload or API/EDI).\n\nThey're very savvy on compliance and IT fronts. The commodities don't change frequently - these are well known brands and products with long product lifecycles - again, this is *not* a marketplace. These are de minimis imports of the same product day in, day out, each to a new consignee.\n\nDesired launch date is ASAP - they could start sending entries as soon as next week if the right partner is found.\n\nThey are looking to speak only with brokers who are well experienced with ecommerce T86. The daily trucking could be on the table in the future as well depending on the partner. This is potentially a multi-million dollar per year account for a brokerage / forwarder with the right service and product lineup. DM me for more detail and if you think you have a solution.",
        "subreddit": "logistics",
        "type": "question",
        "category": "Third-Party Logistics (3PL)",
        "created_utc": "2024-11-13 17:06:07",
        "url": "https://www.reddit.com/r/logistics/comments/1gqhrt6/looking_for_a_us_t86_entry_broker_for_ecommerce/",
        "comments": [
            {
                "id": "lx32a03",
                "author": "WolverinePrimary1802",
                "body": "I can help you. Send me a message.",
                "created_utc": "2024-11-14 13:40:52"
            },
            {
                "id": "lwzneb7",
                "author": "Suitable-Scholar-778",
                "body": "Good luck in your search",
                "created_utc": "2024-11-13 22:09:55"
            },
            {
                "id": "lx6btpl",
                "author": "Responsible_Value878",
                "body": "We might be able to help your client out, who should I reach out to?",
                "created_utc": "2024-11-15 00:00:21"
            }
        ]
    },
    {
        "id": "1gqcc28",
        "title": "Is there a name for this service? And is it common?",
        "content": "We’re a 3PL with 2 warehouses. A potential client has his own warehouse already and all his staff but they have no WMS and nobody internally to be able to implement one. (They tried a year ago, spent $150k and failed) \n\nSo we’re discussing with them that we would add a warehouse to our WMS, onboard them, train their staff to use our system. \n\nBenefit would be smooth on-boarding, support (we’re 5 minutes away), use of our carrier prices. \n\nBut we would not technically operate daily activities there.\n\nSo my question is, is this common? Does it have a name? ",
        "subreddit": "logistics",
        "type": "question",
        "category": "Third-Party Logistics (3PL)",
        "created_utc": "2024-11-13 13:01:03",
        "url": "https://www.reddit.com/r/logistics/comments/1gqcc28/is_there_a_name_for_this_service_and_is_it_common/",
        "comments": [
            {
                "id": "lwxbkrt",
                "author": "PreludeTilTheEnd",
                "body": "Consulting",
                "created_utc": "2024-11-13 15:01:56"
            },
            {
                "id": "lwxjhp7",
                "author": "RealMacMittens",
                "body": "This sounds almost like SaaS (software as a service) if all you're providing them with is a WMS and training.",
                "created_utc": "2024-11-13 15:44:47"
            },
            {
                "id": "lwxjl48",
                "author": "Bearjupiter",
                "body": "I wouldn’t say its common but as long as its minimal to no risk for you, with an adequate agreement and compensation- why not?\n\nYou’d also have access to the data which could be valuable.\n\nThe opportunity I see here, is when the lease is up on their current space, on board them into your company - since all the data and set up will be there.",
                "created_utc": "2024-11-13 15:45:16"
            },
            {
                "id": "lwyy8l3",
                "author": "eseerms",
                "body": "I would avoid this at all costs.  The IT side of this could become a nightmare if things go south.",
                "created_utc": "2024-11-13 20:01:49"
            },
            {
                "id": "lwztyol",
                "author": "Baconaise",
                "body": "I always love hearing this because so many companies blow $100k or more when typical onboarding fees are closer to $5-20k for a single warehouse and annual service fees are closer to $20k-40k for most of the modern saas softwares we hear about people implementing\n\nBut fuck modern saas for not having a pushy sales rep showing up at your door asking for quadruple the price I guess.",
                "created_utc": "2024-11-13 22:45:11"
            }
        ]
    },
    {
        "id": "1gpz86h",
        "title": "Micro 3PL Recommendations or Alternatives for Customized Handling / Fulfillment",
        "content": "Does anyone have experience with a micro 3PLs / micro warehouse that provides highly customized handling / fulfillment services?\n\nFor background, I run a gifting service. The way our service works is i) our customers provide us with a list of recipients, ii) we select a personalized gift for each recipient and purchase it online, iii) we add a handwritten note on behalf of our customer, and iv) we send it along to the gift recipient.  \n  \nHistorically, we've handled all fulfillment in-house. For example, we receive the packages, match it with the corresponding handwritten note, and send it to the gift recipient. We are looking to outsource this process as the logistical component is becoming overly burdensome. \n\nWe are shipping anywhere from 100-500 packages a month. The packages average 12in x 12in / 2lbs. We are typically ordering gifts from Amazon, Etsy, etc. \n\nI've reached out to most large 3PLs and they're not interested in taking on this type of service. I've had some traction with micro 3PLs but their willingness / experience is highly mixed.",
        "subreddit": "logistics",
        "type": "question",
        "category": "Third-Party Logistics (3PL)",
        "created_utc": "2024-11-12 23:49:23",
        "url": "https://www.reddit.com/r/logistics/comments/1gpz86h/micro_3pl_recommendations_or_alternatives_for/",
        "comments": [
            {
                "id": "lww6e96",
                "author": "Greedy-Exchange-1502",
                "body": "I’d recommend checking out HermesLines. I’ve been working with them for a while, and I don’t think this would be an issue for them at all. I can connect you both if you’re interested. From what I’ve seen, they’re also more affordable than most. Highly recommended! Just a note: their main base is in the U.S., so I'm not sure if you're specifically looking for a U.S.-based provider.",
                "created_utc": "2024-11-13 09:39:59"
            },
            {
                "id": "lwuizle",
                "author": "Background-Ad-6035",
                "body": "I can help with this. Please DM if interested. I have the perfect partner for you based in NJ.",
                "created_utc": "2024-11-13 01:36:18"
            },
            {
                "id": "lwulbkm",
                "author": "needhelptoday2023",
                "body": "I have used one based out of Chicago that was pretty good at kitting, etc. Drop me a note if you want an intro",
                "created_utc": "2024-11-13 01:50:00"
            },
            {
                "id": "lwvtk60",
                "author": "squarepeg101",
                "body": "  A lot of warehouses offer this kind of service.    Where are you located?  I could recommend, possibly.",
                "created_utc": "2024-11-13 07:16:38"
            },
            {
                "id": "lx3yft0",
                "author": "Maleficent_Sea1122",
                "body": "Where are you located? Try Freeway Logistics in Houston TX",
                "created_utc": "2024-11-14 16:40:24"
            }
        ]
    },
    {
        "id": "1gpp5ht",
        "title": "Transferable skills?",
        "content": "Greetings everyone, \n\nI have been in a logistics role as a 3PL for about a year now. I am with a large corporation and we serve external customers in rail exclusively. \n\nWhile I do enjoy this position, I plan on moving to another state in the next year or so. I am wondering if I should stay in rail because it is such a niche that takes time to learn and understand in depth or if I should be looking outside my experience? I know the skills are transferable in the logistics space, and serving external customers I could go into an array of account management for B2B but that’s beside the point. \n\nShould I be looking at jobs in rail or expand my horizons into other logistics roles such as procurement, trucking, etc. \n\nWho’s hiring remotely or in the PNW? ",
        "subreddit": "logistics",
        "type": "question",
        "category": "Third-Party Logistics (3PL)",
        "created_utc": "2024-11-12 16:47:06",
        "url": "https://www.reddit.com/r/logistics/comments/1gpp5ht/transferable_skills/",
        "comments": [
            {
                "id": "lwrwru8",
                "author": "reabsco",
                "body": "Rail is a cluster Fck and if you can learn it quickly, then that knowledge will transfer to other modes. Absolutely, do not limit yourself to rail only. Multi-modal customers will appreciate someone that knows different ways they can save $ or different services. It's going to Ruth Chris's and always getting the salad. It's good but don't limit yourself.",
                "created_utc": "2024-11-12 17:07:26"
            },
            {
                "id": "lwtu5nc",
                "author": "squarepeg101",
                "body": "Niche roles are a double edge sword...you'll have trouble finding the perfect fit, but when you do you are in high demand without much competition.    I suggest trying to get on the shipper side as a in house logistics manager.    \nYour experience will make you a Rockstar in house.",
                "created_utc": "2024-11-12 23:10:41"
            }
        ]
    },
    {
        "id": "1gnnhwc",
        "title": "Looking to buy a USA 3PL. ",
        "content": "DM if you’re looking to sell! :)",
        "subreddit": "logistics",
        "type": "question",
        "category": "Third-Party Logistics (3PL)",
        "created_utc": "2024-11-09 23:53:18",
        "url": "https://www.reddit.com/r/logistics/comments/1gnnhwc/looking_to_buy_a_usa_3pl/",
        "comments": [
            {
                "id": "lwenlej",
                "author": "StolenLabias",
                "body": "What multiple are you paying ?",
                "created_utc": "2024-11-10 13:20:19"
            },
            {
                "id": "lwwpu46",
                "author": "RedkikinIt2023",
                "body": "When you close… hit me up and let’s get you integrated with transactional shippers interest policies. Redkik.com attn: Petey",
                "created_utc": "2024-11-13 12:44:16"
            },
            {
                "id": "lwc5obm",
                "author": "needhelptoday2023",
                "body": "DMing you",
                "created_utc": "2024-11-10 00:42:24"
            }
        ]
    },
    {
        "id": "1grq4yg",
        "title": "Can someone help me understand my assignment?",
        "content": "Hi, currently a student and for my SCM class we're supposed to make a report, I am very confused on how to do the calculations or formulas to use.\n\nThis is how far I've gotten but my prof said opening inventory for Period 13 is now 0 and I have to completely restart but when I try to do the formulas (the ones on the right side) it would return a negative inventory, which I don't think is correct.\n\nIf you can help clarify on what steps I should take or explain it to me, I would really appreciate it.\n\n[Inventory Management](https://preview.redd.it/wzvd3hb3d01e1.png?width=1535&format=png&auto=webp&s=ddcc2e51832b0a68970c9c7685ef4af11c672f70)\n\n[Cost Calculations](https://preview.redd.it/zhqddhb3d01e1.png?width=1137&format=png&auto=webp&s=3c491057e92ba61da09e155c58e89f9013ad83e8)\n\n[Case Study](https://preview.redd.it/hl8hlec3d01e1.png?width=1430&format=png&auto=webp&s=1bf1606f716ee42012e4ffceadc18f3b5c1ed5a8)\n\n",
        "subreddit": "supplychain",
        "type": "question",
        "category": "Just-In-Time Inventory",
        "created_utc": "2024-11-15 06:22:39",
        "url": "https://www.reddit.com/r/supplychain/comments/1grq4yg/can_someone_help_me_understand_my_assignment/",
        "comments": [
            {
                "id": "lx8bxat",
                "author": "Horangi1987",
                "body": "It’s a school project….try asking your professor, TA, a tutor, or a classmate? See the professor during office hours, not during class, and they may be willing to walk through it step by step or help you more in depth than if you ask during class.\n\nGetting the steps handed to you on Reddit is not going to teach you anything.",
                "created_utc": "2024-11-15 07:58:04"
            },
            {
                "id": "lx89zef",
                "author": "YinMaestro",
                "body": "Venmo me 50 and I'll make sure u get an A on this assignment",
                "created_utc": "2024-11-15 07:39:41"
            }
        ]
    },
    {
        "id": "1grhd1p",
        "title": "Last mile delivery drones?",
        "content": "What is your hot take on last mile delivery drones - companies like Zipline and Flytrex?\n\nseems to me there are some big barriers to adoption - payload cost, regulatory considerations, consumer perception (noise! Privacy!) etc…. \n\nDo you agree? What would need to change to make them more mainstream? 👀",
        "subreddit": "supplychain",
        "type": "question",
        "category": "Last Mile Innovation",
        "created_utc": "2024-11-14 22:38:14",
        "url": "https://www.reddit.com/r/supplychain/comments/1grhd1p/last_mile_delivery_drones/",
        "comments": [
            {
                "id": "lx5z4qb",
                "author": "TheMightyWill",
                "body": "Why would I ever want a company to drone the shipment to the location when I could just have FedEx do it while the driver is on their route",
                "created_utc": "2024-11-14 22:51:20"
            },
            {
                "id": "lx68qjm",
                "author": "Existing_Performer94",
                "body": "It’s a classic case where the technology and the solution are cool, but the problem is ill defined.",
                "created_utc": "2024-11-14 23:43:21"
            },
            {
                "id": "lx6rqhk",
                "author": "SamusAran47",
                "body": "I think there’s far too much regulatory red tape, heavy infrastructure investment, and too small a value proposition to displace any kind of incumbent last mile players. \n\nIt can and has been successful in certain scenarios- for example, there is drone medicine delivery in parts of rural sub-Saharan Africa where the roads are frequently too muddy to drive on, or don’t exist at all. \n\nHowever, freight is not tech- these last-mile carriers don’t have huge margins to justify an enormous upfront investment in widespread drone tech, let alone convincing consumers to trust it. A lot of people don’t even like having a virtual assistant like Alexa in their house- how would they feel about a drone delivering their Amazon purchases? \n\nUltimately, I think there will be limited situations where it could be useful, but don’t expect to see it rolled out in any kind of mainstream way.",
                "created_utc": "2024-11-15 01:29:53"
            },
            {
                "id": "lx6x3jq",
                "author": "scmsteve",
                "body": "It’s similar to blockchain. Great idea, great possibilities and people have e been discussing the topics for years. Widespread implementation however is elusive for various reasons. This is the way warehouse automation was perceived 10 years ago but it’s gaining popularity and more widespread use. \n\nIn the end, it’s a free market type idea that will succeed or fail based on its risk/reward or ROI perception.",
                "created_utc": "2024-11-15 01:59:34"
            },
            {
                "id": "lx5yl4a",
                "author": "Dub-MS",
                "body": "I don’t see this ever happening.",
                "created_utc": "2024-11-14 22:48:31"
            }
        ]
    },
    {
        "id": "1gr7ma2",
        "title": "Looking to get into supply chain, interviewing for a buyer position at a food distributor",
        "content": "I grew up in the food industry, working with my dad in our pizza business. We owned 3 retail outlets and a small wholesale facility where we made dough, sauce, and cheese for several licensed locations. I personally owned and ran one of the retail stores for 10 years and was mainly responsible for the other businesses for about 5-6 years. We sold everything in 2022, and I took an accounting manager position at a 3PL company.\n\nThe 3PL company I currently work for has 4 warehouses spread out along the East Coast, plus a trucking company. Most of our trucking is for draying containers from the ports to store in our warehouses. I also help manage a new sugar import business alongside one of the C-suite officers. We import sugar from overseas and resell it by the metric ton in the U.S. My role is mainly focused on costing and accounting.\n\nWhile I'm good at accounting, I don’t really enjoy it and don’t see much of a future at the small company I’m at now. I’ve been hearing a lot about SC being a good field to get into, and that my accounting, operations management, and procurement skills would transfer well. But I haven’t had much luck with my applications over the past few months.\n\nRecently, I landed an interview for a buyer position at a major food distributor here in the Philly area. I’m looking for advice on how to frame my experience for this role. I feel like I might be a bit overqualified, but it's a large company, so I’m hoping I’ll be able to grow there. Does anyone have any advice or warnings? The Glassdoor salary range for a buyer at this company is $55k-90k. I’m aiming for $75-80k—does that sound realistic?",
        "subreddit": "supplychain",
        "type": "question",
        "category": "Third-Party Logistics (3PL)",
        "created_utc": "2024-11-14 15:41:45",
        "url": "https://www.reddit.com/r/supplychain/comments/1gr7ma2/looking_to_get_into_supply_chain_interviewing_for/",
        "comments": [
            {
                "id": "lx5567l",
                "author": null,
                "body": "[deleted]",
                "created_utc": "2024-11-14 20:17:38"
            }
        ]
    },
    {
        "id": "1gqy2l3",
        "title": "Burnt out, behind on everything, now what?",
        "content": "I’m a senior buyer at an aerospace company, and I am burned out as hell.\n\nSurvived multiple layoffs, but it left us with so few people in our dept.  \nI dread logging in every day, and that has been reflecting in the amount of work I get done.  Then even on days when I am productive, there’s so much work that I only break even.\n\nAre there other similarly paying (80-90k) jobs in supply chain that I am qualified for that are a bit more chill?  Been a buyer for 4 years and Sr buyer for 1, and have my green belt.",
        "subreddit": "supplychain",
        "type": "question",
        "category": "Eco-Friendly",
        "created_utc": "2024-11-14 05:44:57",
        "url": "https://www.reddit.com/r/supplychain/comments/1gqy2l3/burnt_out_behind_on_everything_now_what/",
        "comments": [
            {
                "id": "lx1qov1",
                "author": "coronavirusisshit",
                "body": "80-90k is low for senior buyer especially if you live in VHCOL.\n\nGo find a better job.",
                "created_utc": "2024-11-14 06:08:27"
            },
            {
                "id": "lx1qvu5",
                "author": "modz4u",
                "body": "Buyer in a different industry that is more chill. So don't go to fast moving consumer goods for example 😉\n\nIf you can do the job in aerospace I think you can do it in any industry and be more relaxed",
                "created_utc": "2024-11-14 06:10:14"
            },
            {
                "id": "lx1zgtf",
                "author": "mattdamonsleftnut",
                "body": "Are you open to relocate? There’s so many aerospace buying jobs in my area and I’m sure around the US…\n\nThey are all way above your current rate.",
                "created_utc": "2024-11-14 07:35:46"
            },
            {
                "id": "lx2qr02",
                "author": "Sea_Mongoose1138",
                "body": "I’m in the same position but only making 60k. Laid off half my department plus the purchasing manager so that work was handed to me as well. I’m so overwhelmed all day, every day. Then this week they’ve dumped Sox and iso audits on me. Been hunting for a year with no luck. I’ve pleaded my case for more money and a title to reflect my additional responsibilities. It goes up the chain and falls dead at the csuite level. The burn out is real.",
                "created_utc": "2024-11-14 12:19:15"
            },
            {
                "id": "lx2tnkq",
                "author": "mercedesaudibmw",
                "body": "Government procurement has it's own suck and everchanging ruleset but is generally more chill than private.  \nLots offer some remote aspect, you'll get paid less most likely than what you're used to but you gain a strict 40 hour work week (for the most part) and a lot of time off and benefits. Most of my co-workers worked private for decades and came to public to coast-ish in their final working years. Food for thought.",
                "created_utc": "2024-11-14 12:41:38"
            }
        ]
    },
    {
        "id": "1gquv3l",
        "title": "Retail Buyer Seeking Help On Inventory Management",
        "content": "Hi Reddit,\n\nI am a Buyer for a large retail corporation and am looking to advance my development by learning about Supply Chain. I have gotten to a stage in my career where it has become evident that I need a better understanding of inventory management, specifically, understanding how much to buy of certain items year after year after generating sales data. \n\nThe specific predicament I’m in is I am ill-equipped to do. We have a large planning team in charge of establishing Open-To-Buys/Forecasts, but when it comes to me determining optimal inventory levels of specific *products*, I am at a loss. \n\nCan someone point me in the direction of a good online course to learn more and figure this out? Free or paid, either works.\n\nThanks! ",
        "subreddit": "supplychain",
        "type": "question",
        "category": "Just-In-Time Inventory",
        "created_utc": "2024-11-14 02:44:16",
        "url": "https://www.reddit.com/r/supplychain/comments/1gquv3l/retail_buyer_seeking_help_on_inventory_management/",
        "comments": [
            {
                "id": "lx1dr4r",
                "author": "Stubby_Shillelagh",
                "body": "You're not going to learn everything you'll want/need from a single online course.  To really understand everything you want to know, you really do need a degree; you're not going to learn statistics and stochastic simulation and newsvendor models and all the other necessary context from just one course. \n\nHowever, if you only had to understand one thing, you would need to understand how to calculate a re-order point and how to work with that.\n\nIf you're not an expert in data science/forecasting/ML/statistics, you would want to get with someone who is (i.e. in the planning team), and then get them to design a solution to calculate your re-order point (\"ROP\").  That is the minimum \"floor\" of inventory you have, at which point you trigger a replenishment order.\n\nIf your lead time for replenishment (i.e. the time between the point at which you press the \"re-order\" button and the time you receive that replenishment order) is short, then you are in luck and you might be able to greatly simplify this.  If your lead time for replenishment is lengthy or highly variable, you would generally want to use a stochastic simulation to calculate your \"optimal inventory level\" for a *specific product*, which is what you said you wanted to know how to do.\n\nThe way you want to set a re-order point is to calculate the joint conditional probability distribution of the lead time and the demand forecast, and then optimize that according to your desired \"Cycle Service Level\" or CSL.  If your CSL is 90%, then you are trying to set an inventory level that will permit you to remain in stock on that product at least 90% of the time.  You can play with the value to be more or less aggressive.\n\nSkipping over a lot of other details here — you should lean on your planning and forecasting team about these — once you have an optimal ROP for each Sku of interest, then you trigger a replenishment order whenever you are at or below the ROP (or close to it).  This is how you manage.\n\nActually implementing this in practice is non-trivial to do, but it can be done.  I have done this for my small wine importing company.  We have long and highly variable lead times and highly seasonal demand for our core products, so the ROP changes as we move through time, according to seasonality.  Honestly, it's easier to manage these things when you can just do it all yourself sometimes — otherwise you need to coordinate the efforts of a large team, which can sometimes be costly and can eat up budget if you're not careful.",
                "created_utc": "2024-11-14 04:23:12"
            },
            {
                "id": "lx4473t",
                "author": "Mysterious_View1515",
                "body": "I don't know what stock and supply management is like in your company, but perhaps stock coverage replacement could help.\nI work in an agricultural cooperative and here the policy for resale SKUs is three months of stock coverage.\n\nInventory coverage = (Current Inventory + Open Purchase Orders) / (Last 12 months/12)\n\nAnother way we use is to analyze inventory turnover (frequency of sales) combined with coverage.\n\nIf we sell a SKU between 7 and 12 months of a year, the turnover is A. Between 4 and 6 months, it is B, and below 4, C.\n\nMaybe I can give you some guidance.",
                "created_utc": "2024-11-14 17:09:48"
            },
            {
                "id": "lx5941n",
                "author": "N62B44",
                "body": "Also, something to consider is your inventory turns and days or weeks of supply you want to carry at the warehouse. Depending on your industry, you may or may not have lot expiration dates/shelf life to think about. Based on your lead times, you’ll generate your reorder point. After that, you need to decide how many days or weeks you feel comfortable having on hand. If you have a high moving item or material that you know has 2 week lead time, then having 3 weeks of inventory might not hurt you. \n\nLook at your suppliers reliability as well. If they’re always shipping on time and in full then you can asume you’ll be ok should you run a bit lean during a peak period or promotion. However, if they’re shorting you and have supply issues, you know to stock up a bit. Safety stock levels will be more important here.",
                "created_utc": "2024-11-14 20:37:56"
            },
            {
                "id": "lx3jq9w",
                "author": "aquaculturist13",
                "body": "MITx MicroMasters in supply chain mgmt... I'm doing it now and learned those in SC1x. I don't think it'll replace a degree or real world experience, but it's a very affordable in depth primer for sure.",
                "created_utc": "2024-11-14 15:23:26"
            },
            {
                "id": "lx1vgf4",
                "author": "Any-Walk1691",
                "body": "How have you lasted this long? Buyers should work hand in hand with planners.",
                "created_utc": "2024-11-14 06:54:19"
            }
        ]
    },
    {
        "id": "10xaid0",
        "title": "WAREHOUSING SOLUTIONS in MIAMI,FL",
        "content": "STATE of the ART warehouse in MIAMI,FL offering:\n\n**#fulfillment** **#3pl** **#storage** **#importexport** **#customs** **#DRAYAGE** **#inland** **#delivery** **#software** **#support** **#warehouse**\n\n&#x200B;\n\nhttps://preview.redd.it/1pkibn1a31ha1.jpg?width=2016&format=pjpg&auto=webp&s=a6086fe4ad716881c454870e74f9e181b6cc62c9",
        "subreddit": "freight",
        "type": "question",
        "category": "Third-Party Logistics (3PL)",
        "created_utc": "2023-02-08 20:56:15",
        "url": "https://www.reddit.com/r/freight/comments/10xaid0/warehousing_solutions_in_miamifl/",
        "comments": [
            {
                "id": "lcwmvwd",
                "author": "TrueFollowing9503",
                "body": "You need to get on [www.crossdockbuddy.com](http://www.crossdockbuddy.com)",
                "created_utc": "2024-07-12 22:22:45"
            },
            {
                "id": "jcx30a2",
                "author": "MurkyResort7401",
                "body": "pls shot me at kevintan@znder.com",
                "created_utc": "2023-03-20 05:48:58"
            },
            {
                "id": "jgff0yo",
                "author": "Soggy_Extreme_9301",
                "body": "Need truck? Reefer or dey van?",
                "created_utc": "2023-04-16 01:09:33"
            }
        ]
    }
]